app/views/profiles/show.html.erb

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."user_id" = 1 AND "favorites"."profile_id" = 1
---
		<h3><%= @fb_object['name'] %></h3>
      <p id="fav"><% if Favorite.where({:user_id => session[:user_id], :profile_id=>@profile.id}).empty? %>

SELECT COUNT(*) FROM "votes" WHERE "votes"."comment_id" = 1 AND "votes"."up" = 'true'
---
                             onclick="voteUp('<%= @profile.id %>','<%= comment.id %>', this.nextElementSibling)">
                      <p><%= comment.votes.where(:up=>'true').size %></p>