app/views/favorites/index.html.erb

SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT 1  [["id", 1]]
---
  <tr>
    <% @profile = Profile.find(favorite.profile_id) %>