app/controllers/comments_controller.rb

  def create
    @profile = Profile.find(params[:profile_id])
    @comment = @profile.comments.new(:body => params[:body], :user_id=>current_user.id )

      if @comment.save
---
SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "comments" ("body", "created_at", "downvote", "profile_id", "updated_at", "upvote", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)  [["body", "a"], ["created_at", Thu, 09 May 2013 23:19:24 UTC +00:00], ["downvote", 0], ["profile_id", 1], ["updated_at", Thu, 09 May 2013 23:19:24 UTC +00:00], ["upvote", 0], ["user_id", nil]]