app/controllers/favorites_controller.rb

  def index
    @favorites = current_user.favorites.all
---
SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = 1

  def create
    @profile = Profile.find(params[:profile_id])
    # If the user has not favorited the profile, create the favorite record
    if current_user.favorites.where(:profile_id=>@profile.id).empty?
    @favorite = current_user.favorites.new
    @profile.favorites << @favorite
---
SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT 1  [["id", "1"]]
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."user_id" = 1 AND "favorites"."profile_id" = 1
INSERT INTO "favorites" ("created_at", "profile_id", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", Sat, 11 May 2013 15:51:53 UTC +00:00], ["profile_id", 1], ["updated_at", Sat, 11 May 2013 15:51:53 UTC +00:00], ["user_id", 1]]