app/controllers/home_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
  def index
  	if session[:user_id]
  		user = User.find(session[:user_id])