app/controllers/profiles_controller.rb

SELECT "profiles".* FROM "profiles" WHERE "profiles"."fbid" = '224413'
SELECT 1 AS one FROM "profiles" WHERE "profiles"."fbid" = '224413' LIMIT 1
INSERT INTO "profiles" ("created_at", "fbid", "total_ratings", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Thu, 09 May 2013 23:19:21 UTC +00:00], ["fbid", "224413"], ["total_ratings", "{}"], ["updated_at", Thu, 09 May 2013 23:19:21 UTC +00:00]]
---
  def show_profile
    profiles = Profile.where(:fbid => params[:fbid])
    if profiles.empty?
      @profile = Profile.new(fbid:params[:fbid])
      @profile.save

SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT 1  [["id", "1"]]
---
  def getRatings
    @profile = Profile.find(params[:id])