app/controllers/ratings_controller.rb

  def create
    @profile = Profile.find(params[:profile_id])
    @rating = @profile.ratings.new(:user_id => session[:user_id], :rate => params[:rate], :category => params[:categ])
    @rating.save
---
SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT 1  [["id", "2"]]
INSERT INTO "ratings" ("category", "created_at", "profile_id", "rate", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["category", "Appearances"], ["created_at", Wed, 02 Oct 2013 00:28:51 UTC +00:00], ["profile_id", 2], ["rate", 3.5], ["updated_at", Wed, 02 Oct 2013 00:28:51 UTC +00:00], ["user_id", 1]]

  def update
    @profile = Profile.find(params[:profile_id])
    @rating = @profile.ratings.where(:user_id => session[:user_id], :category => params[:categ])[0]
    if @rating
      @profile.update_rating(@rating.category, @rating.rate, params[:rate].to_f)
---
SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT 1  [["id", "2"]]
SELECT "ratings".* FROM "ratings" WHERE "ratings"."profile_id" = 2 AND "ratings"."user_id" = 1 AND "ratings"."category" = 'Appearances'
UPDATE "profiles" SET "total_ratings" = '{"Appearances":{"sum":4.0,"number":1}}', "updated_at" = '2013-10-02 00:28:52.870992' WHERE "profiles"."id" = 2
UPDATE "ratings" SET "rate" = 4.0, "updated_at" = '2013-10-02 00:28:52.874954' WHERE "ratings"."id" = 1