app/controllers/sessions_controller.rb

INSERT INTO "users" ("created_at", "email", "fbid", "friend_list", "gender", "gender_pref", "name", "provider", "token", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT "users".* FROM "users" WHERE "users"."provider" = 'facebook' AND "users"."fbid" = '1605016083' LIMIT 1
UPDATE "users" SET "friend_list" = NULL, "updated_at" = '2013-05-09 19:45:08.632121' WHERE "users"."id" = 1
---
  def create
    auth = request.env["omniauth.auth"]

    session['fb_auth'] = auth
    session['fb_access_token'] = auth['credentials']['token']
    session['fb_error'] = nil
    user = User.where(:provider => auth['provider'],
    :fbid => auth['uid']).first || User.create_with_omniauth(auth, session['fb_access_token'])

    sign_in(user)
    session[:user_id] = user.id
    graph = Koala::Facebook::GraphAPI.new(session['fb_access_token']) # Note that session is used here
    @fbprofile = graph.get_object('me')
    user.gender=@fbprofile['gender']
    user.friend_list = nil
    user.save