app/controllers/users_controller.rb

  def account
    @user = User.find(session[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]

  def update
    @user = User.find(params[:id])

    if @user.gender_pref.nil?
      respond_to do |format|
        if @user.update_attributes(params[:user])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "users" SET "gender_pref" = 'female', "updated_at" = '2013-05-08 18:22:04.707040' WHERE "users"."id" = 1

  def showFriendsList
    @user=User.find(session[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]