app/controllers/votes_controller.rb

  def create
    # If user has not voted on the comment, created a new vote
    if current_user.votes.where(:comment_id=>params[:comment_id] ).empty?
    @vote = current_user.votes.new(:up=>params[:up])
    @comment = Comment.find(params[:comment_id])
    @comment.votes << @vote

    if @vote.save
      # Return vote count
      render json: Vote.where(:up=> params[:up], :comment_id => params[:comment_id]).size, status: :created, location: @vote
---
SELECT 1 AS one FROM "votes" WHERE ("votes"."comment_id" = 1 AND "votes"."id" != 1 AND "votes"."user_id" = 1) LIMIT 1
SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "votes" ("comment_id", "created_at", "up", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["comment_id", 1], ["created_at", Thu, 09 May 2013 23:19:30 UTC +00:00], ["up", "true"], ["updated_at", Thu, 09 May 2013 23:19:30 UTC +00:00], ["user_id", 1]]
SELECT COUNT(*) FROM "votes" WHERE "votes"."up" = 'true' AND "votes"."comment_id" = 1